app/views/page_users/partial/_form_task.html.erb

SELECT "subjects".* FROM "subjects"
---
    <div class="col-sm-10">
      <%= f.select :titl, Subject.all.collect { |p| [p.name, p.name] }, class: 'custom-select custom-select-lg mb-3' %>