app/views/page_users/partial/_tasks.html.erb

      <div>
        <% task.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = $1  [["task_id", 4]]