app/views/tasks/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      <div class="card-body">
        <%= User.find(task[:user_id])[:name] %>

SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = $1  [["task_id", 2]]
---
      <div>
        <% task.tags.each do |tag| %>