app/views/tasks/new.html.erb

      <%= f.label :titl %>
      <%= f.select :titl, Subject.all.collect { |p| [p.name, p.name] }, class: 'form-select', aria_label: 'Default select example' %>
---
SELECT "subjects".* FROM "subjects"