app/views/tasks/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <div class="card-body">
      <%= User.find(@task.user_id)[:name] %>