app/views/tasks/partial/_form_comment.html.erb


          <%= comment.likes.count %> Likes
          <% like = current_user.likes.find_by(comment: comment) %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."comment_id" = $2 LIMIT $3  [["user_id", 2], ["comment_id", 1], ["LIMIT", 1]]