app/views/tasks/partial/_form_update_task.html.erb

SELECT "subjects".* FROM "subjects"
---
      <%= f.label :titl %>
      <%= f.select :titl, Subject.all.collect { |p| [p.name, p.name] }, class: 'form-select', aria_label: 'Default select example' %>