app/controllers/comments_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 ORDER BY "tasks"."created_at" DESC LIMIT $2  [["id", 15], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "task_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "andreokos@gg.ru"], ["body", "fdsbgdf"], ["task_id", 2], ["user_id", 4], ["created_at", "2021-10-16 06:36:23.968390"], ["updated_at", "2021-10-16 06:36:23.968390"]]
---
  def create
    @task = Task.find(params[:task_id])
    @comment = @task.comments.new(comment_params)
    @comment.user_id = current_user.id
    @comment.username = current_user.email
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 13]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    @task = Task.find params[:id]
    @comment = Comment.find(params[:task_id]).delete