app/controllers/page_users_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tasks = Task.all
    @user = User.find(params[:id])
    @tasks_user = []
    @tasks.each do |task|