app/controllers/tags_controller.rb

  def create
    @tag = Tag.create tag_params
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tags"."id" IN (NULL)