app/controllers/tags_controller.rb

  def create
    @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create_tag(task, tag)
    @tag = Tag.new(name: tag)
    task.tags << @tag
    @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ivan"], ["created_at", "2021-10-17 12:18:57.351626"], ["updated_at", "2021-10-17 12:18:57.351626"]]
INSERT INTO "tags_tasks" ("task_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4)  [["task_id", 4], ["tag_id", 25], ["created_at", "2021-10-17 12:18:57.367574"], ["updated_at", "2021-10-17 12:18:57.367574"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "jfjf"], ["created_at", "2021-10-17 13:56:43.570144"], ["updated_at", "2021-10-17 13:56:43.570144"]]

  def find_tasks
    @tasks = []
    @tags = []

    tag_params[:name].split(',').each do |tag|
      @tags << Tag.where(name: tag)[0]
    end

    Task.all.each do |task|
      binding.pry
      if task.tags.include?(@tags)
        @tasks << task
      end
    end

    @tasks_find = Task.where(tags: @tags)
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "tag"], ["created_at", "2021-10-16 12:14:00.875023"], ["updated_at", "2021-10-16 12:14:00.875023"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1  [["name", "math"]]
SELECT "tasks".* FROM "tasks"
SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = $1  [["task_id", 13]]
INSERT INTO "tags_tasks" ("task_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4)  [["task_id", 4], ["tag_id", 16], ["created_at", "2021-10-16 12:14:01.493600"], ["updated_at", "2021-10-16 12:14:01.493600"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."tag_s" IN ($1, $2)  [["tag_s", 1], ["tag_s", 33]]