app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
    @tasks_sub = []
    @task_tags = []
    @tasks.each do |task|
      if task[:subject_id].to_s == params[:subject_id]
        @tasks_sub << task
        task.tags.each do |tag|
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = $1  [["task_id", 2]]

  def show
    @task = Task.find params[:id]
    @tags = @task.tags
    @comments = []
    Comment.all.each do |comment|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 ORDER BY "tasks"."created_at" DESC LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

  def create
    @subject = Subject.where(name: params[:task][:titl]).first

    @task = @subject.tasks.new(task_params)
    @task.user_id = current_user.id
    if @task.save
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."name" = $1 ORDER BY "subjects"."id" ASC LIMIT $2  [["name", "Algebra"], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "titl", "condition", "answer", "subject_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @task = Task.find params[:id]
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @task = Task.find params[:id]
    if params[:task][:title] == @task[:titl]
      @task.update task_params
      redirect_to subject_task_path(params[:subject_id], @task), notice: 'Task was succesfully update'
    else
      @task.delete
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1 WHERE "tasks"."id" = $2  [["updated_at", "2021-10-17 15:18:17.253258"], ["id", 14]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]

  def destroy
    @task = Task.find params[:id]
    @idd = @task.subject_id
    @task.delete
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]