app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "andreo.kosmitch@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "image" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["image", "https://avatars.githubusercontent.com/u/88313239?v=4"], ["updated_at", "2021-10-17 04:45:32.165623"], ["id", 1]]
---
  def self.from_omniauth(access_token)
    user = User.where(email: access_token.info.email).first

    unless user
      user = User.create(email: access_token.info.email,
                         name: access_token.info.name,
           password: Devise.friendly_token[0,20]
        )
    end
    user.name = access_token.info.name
    user.image = access_token.info.image
    user.uid = access_token.uid
    user.provider = access_token.provider
    user.save